In [110]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd

In [111]:
# Files to load
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

In [112]:
# Read the city data file and store it in a pandas DataFrame.
city_data_df = pd.read_csv(city_data_to_load)
city_data_df.head(10)

            city  driver_count   type
0    Richardfort            38  Urban
1   Williamsstad            59  Urban
2    Port Angela            67  Urban
3     Rodneyfort            34  Urban
4    West Robert            39  Urban
5   West Anthony            70  Urban
6    West Angela            48  Urban
7  Martinezhaven            25  Urban
8      Karenberg            22  Urban
9    Barajasview            26  Urban

In [113]:
# Read the ride data file and store it in a pandas DataFrame.
ride_data_df = pd.read_csv(ride_data_to_load)
ride_data_df.head(10)

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2018-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2018-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2018-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2018-02-10 23:22:03  23.44  5149245426178
4          South Jack  2018-03-06 04:28:35  34.58  3908451377344
5        South Latoya  2018-03-11 12:26:48   9.52  1994999424437
6       New Paulville  2018-02-27 11:17:56  43.25   793208410091
7        Simpsonburgh  2018-04-26 00:43:24  35.98   111953927754
8     South Karenland  2018-01-08 03:28:48  35.09  7995623208694
9       North Jasmine  2018-03-09 06:26:29  42.81  5327642267789

In [114]:
#merge the data sets
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the DataFrame
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2018-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2018-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2018-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2018-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2018-03-06 04:28:35,34.58,3908451377344,46,Urban

In [115]:
#create data frames by city type
urban_cities_df = pyber_data_df[pyber_data_df["type"] == "Urban"]

suburban_cities_df = pyber_data_df[pyber_data_df["type"] == "Suburban"]

rural_cities_df = pyber_data_df[pyber_data_df["type"] == "Rural"]

In [116]:
urban_cities_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2018-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2018-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2018-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2018-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2018-03-06 04:28:35,34.58,3908451377344,46,Urban

In [117]:
# Get the number of rides for types.
total_ride_count_df = pyber_data_df.groupby(["type"]).count()["ride_id"].map("{:,}".format)
total_ride_count_df.head()

type
Rural         125
Suburban      625
Urban       1,625
Name: ride_id, dtype: object

In [118]:
#get total fares by type
total_fares_df = pyber_data_df.groupby(["type"]).sum()["fare"].map("${:,.2f}".format)
total_fares_df.head()

type
Rural        $4,327.93
Suburban    $19,356.33
Urban       $39,854.38
Name: fare, dtype: object

In [119]:
#total drivers by type
total_drivers_df = pyber_data_df.groupby(["type"]).sum()["driver_count"].map("{:,}".format)
total_drivers_df.head()

type
Rural          537
Suburban     8,570
Urban       59,602
Name: driver_count, dtype: object

In [120]:
# Combine the data into a single dataset.
Pyber_data_complete_df = pd.merge(total_ride_count_df, total_drivers_df, on="type")
Pyber_data_complete_df.head()

         ride_id driver_count
type
Rural        125          537
Suburban     625        8,570
Urban      1,625       59,602

In [121]:
Pyber_data_complete_df = pd.merge(Pyber_data_complete_df, total_fares_df, on="type")
Pyber_data_complete_df.head()

         ride_id driver_count        fare
type
Rural        125          537   $4,327.93
Suburban     625        8,570  $19,356.33
Urban      1,625       59,602  $39,854.38

In [122]:
Pyber_data_complete_df=Pyber_data_complete_df.rename(columns = {'type':'', 'ride_id':'Total Rides', 'driver_count':'Total Drivers', 'fare':'Total Fares'})

In [123]:
Pyber_data_complete_df

         Total Rides Total Drivers Total Fares
type
Rural            125           537   $4,327.93
Suburban         625         8,570  $19,356.33
Urban          1,625        59,602  $39,854.38

In [124]:
Pyber_data_complete_df.dtypes

Total Rides      object
Total Drivers    object
Total Fares      object
dtype: object

In [128]:
#Delete the index name.
del Pyber_data_complete_df.index.name

In [129]:
Pyber_data_complete_df

         Total Rides Total Drivers Total Fares
Rural            125           537   $4,327.93
Suburban         625         8,570  $19,356.33
Urban          1,625        59,602  $39,854.38

In [132]:
#Calculate the average fare per ride and the average fare per driver by city type.
Pyber_data_complete_df['Total Rides']

Rural         125
Suburban      625
Urban       1,625
Name: Total Rides, dtype: object

In [153]:
total_ride_count_df.to_frame()

         ride_id
type
Rural        125
Suburban     625
Urban      1,625

In [135]:
#Part 2 of challenge
#rename columns
pyber_data_df=pyber_data_df.rename(columns ={'city': 'City', 'date':'Date','fare':'Fare', 'ride_id': 'Ride Id','driver_count': 'No. Drivers', 'type':'City Type'})

In [136]:
pyber_data_df.head()

,City,Date,Fare,Ride Id,No. Drivers,City Type
0,Lake Jonathanshire,2018-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2018-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2018-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2018-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2018-03-06 04:28:35,34.58,3908451377344,46,Urban

In [137]:
#set the index to the Date column
pyber_data_df.set_index('Date')
pyber_data_df.head()

,City,Date,Fare,Ride Id,No. Drivers,City Type
0,Lake Jonathanshire,2018-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2018-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2018-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2018-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2018-03-06 04:28:35,34.58,3908451377344,46,Urban

In [146]:
#Create a new DataFrame using copy()
copy_pyber_data_df = pyber_data_df[['Date', 'City Type', 'Fare']].copy()

In [147]:
copy_pyber_data_df.head()

                  Date City Type   Fare
0  2018-01-14 10:14:22     Urban  13.83
1  2018-03-04 18:24:09     Urban  30.24
2  2018-02-24 04:29:00     Urban  33.44
3  2018-02-10 23:22:03     Urban  23.44
4  2018-03-06 04:28:35     Urban  34.58

In [148]:
#Set the index to the datetime data type
copy_pyber_data_df.set_index('Date')

                    City Type   Fare
Date
2018-01-14 10:14:22     Urban  13.83
2018-03-04 18:24:09     Urban  30.24
2018-02-24 04:29:00     Urban  33.44
2018-02-10 23:22:03     Urban  23.44
2018-03-06 04:28:35     Urban  34.58
...                       ...    ...
2018-04-29 17:04:39     Rural  13.38
2018-01-30 00:05:47     Rural  20.76
2018-02-10 21:03:50     Rural  11.11
2018-05-07 19:22:15     Rural  44.94
2018-04-25 10:20:13     Rural  55.84

[2375 rows x 2 columns]

In [149]:
copy_pyber_data_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2375 entries, 0 to 2374
Data columns (total 3 columns):
Date         2375 non-null object
City Type    2375 non-null object
Fare         2375 non-null float64
dtypes: float64(1), object(2)
memory usage: 74.2+ KB

In [151]:
#Calculate the sum() of fares by the type of city and date using groupby() to create a Series.
copy_total_fares_df = copy_pyber_data_df.groupby(["City Type"]).sum()["Fare"].map("${:,.2f}".format)
copy_total_fares_df.head()

City Type
Rural        $4,327.93
Suburban    $19,356.33
Urban       $39,854.38
Name: Fare, dtype: object

In [160]:
#Convert the groupby() Series into a DataFrame
copy_total_fares_df.to_frame()

                 Fare
City Type
Rural       $4,327.93
Suburban   $19,356.33
Urban      $39,854.38

In [161]:
pyber_pivot_table = pd.pivot_table(copy_pyber_data_df, values='Fare', index='Date', columns = 'City Type')

In [162]:
pyber_pivot_table

City Type            Rural  Suburban  Urban
Date
2018-01-01 00:08:16    NaN       NaN  37.91
2018-01-01 00:46:46    NaN     47.74    NaN
2018-01-01 02:07:24    NaN     24.07    NaN
2018-01-01 03:46:50    NaN       NaN   7.57
2018-01-01 05:23:21    NaN       NaN  10.75
...                    ...       ...    ...
2018-05-08 04:20:00    NaN       NaN  21.99
2018-05-08 04:39:49    NaN       NaN  18.45
2018-05-08 07:29:01    NaN       NaN  18.55
2018-05-08 11:38:35    NaN       NaN  19.77
2018-05-08 13:10:18    NaN       NaN  18.04

[2375 rows x 3 columns]

In [164]:
pyber_dates_given_df = pyber_pivot_table.loc[pyber_pivot_table['Date'].between('2017-01-15', "2017-01-20")]

KeyError: 'Date'